{
  "blogs": [
    {
      "title": "Flying at Mara",
      "body": "The favoured route for a Masai Mara fly-in safari is by flying from Nairobi Wilson Airport (WIL). From here it is a short (between 45 and 60 minutes) flight to the Mara. For this reason, flying into the Masai Mara is our recommended mode of travel. Although road conditions have improved in recent years, there are still considerable stretches of road that are in very poor condition. There are several airstrips in and around the Masai Mara for you to fly into. Which one you fly into will depend on where you decide to stay during your safari. Flights to the Mara are operated by airlines such as SafariLink and AirKenya. Upon your arrival at the airstrip closest to your accommodation, a safari vehicle will be waiting to take you to your Masai Mara safari lodge. The good news is... you are now in the Masai Mara – so you can start spotting wild animals by air during your flight and on the ground while in the safari vehicle taking you to your camp. Read all about flights to Masai Mara.It is also possible to fly from Kilimanjaro International Airport (JRO) in Tanzania. There are also direct flights (mostly in high season) from the Kenyan coast (Mombasa and Diani) and other national parks in Kenya such Amboseli National Park and Samburu National Reserve.",
      "author": "Capt. Khairat",
      "id": 1
    },
    {
      "title": "What to do when lost in the skys",
      "body": "lorem...",
      "author": "Capt. Hemant",
      "id": 2
    },
    {
      "title": "SkyDiving Pilots",
      "body": "lorem...",
      "author": "Capt. Saloni",
      "id": 3
    },
    {
      "title": "Kenya, best airspace in the world",
      "body": "lorem...",
      "author": "Capt. Unathi",
      "id": 4
    },
    {
      "title": "Kenya School of Flying",
      "body": "lorem...",
      "author": "Capt. Nyaa",
      "id": 5
    },
    {
      "title": "My First Solo Experience",
      "body": "After roughly 25 flight hours, i got my first solo. This was back when i was in form 3... i had just turned 16 years about 4 months prior which is by law the recommended age for acquiring a PPL license. My instructor (Capt. Hamza) casually asked me if i'm ready for my First solo and boom in no time there it was. \"Lets go for a full stop landing\", he said and we taxied the plane all the way to the front of the school waiting area... Kidogo, i hear him request the ATC for a first solo, he wishes me good luck and he leaves. It was a bit nerve wrecking, I even confused my radio calls kidogo but as soon as i lined up on that threshold with the center-line bang on... i knew there was no turning back. I requested for take of on Runway 'One' 'Seven' in HKML and soon i was airbone for a right handed circuit.. things felt different, the weight balance of the plane was different, it tilted towards my side and i knew it was because i was alone, this is when it actually hit me that i was gonna live my dream of being a pilot. The circuit was just 7mins long, 15mins if you count the taxiing and all.... those were the best 15mins of my life... after i landed for a full stop landing one KQ pilot congratulated me via the radios. I then taxied the plane to the apron as i was directed by Mwinyi our Kenya School of flying Marshaller at the time. The chocks were in and i pulled the mixture to cut the engine... turned the key and chucked the plane placing the propeller of the Cessna 150 in the horizontal position. Soon came mad cheers from my friends and i was washed with AVGAS and oil... This was an experience i will never forget !",
      "author": "Capt. Nyaa",
      "id": 6
    }
  ]
}